---
# Crash Course Python for Data Science - Intro to Pandas 
---
# 02 - Indexing & Subsetting DataFrames
---

### Learn how to retrieve certain values from your DataFrame
DataFrames represent your data in a convenient way. Exploratory data analysis (EDA) involves selecting different "pieces" of your data to analyze apart from the rest. To do this you need to learn how to access specific portions of a data frame via indexing, slicing, and filtering your data.

### Begin by importing your tools

In [6]:
# Let's begin by importing pandas:
import pandas as pd
print('Pandas imported!')

Pandas imported!

## Indexing
### A refresher: You've seen this before!

In [7]:
# Certain Python objects are 'subscriptable'. That's just a 
# fancy way of saying you can index them.

x = "A string."
y = [["Another", "string"],
     ["because", "why not?"]]
z = 233445

In [8]:
# Are integers subscriptable?
z[3]

TypeError: 'int' object is not subscriptable

In [9]:
# We know strings are. Which makes some intuitive sense because they're comprised of 
# characters. Rememeber how to retrieve the element in 5th position from the end?
x[-5]

x[2:5]

'str'

In [10]:
# List of lists (or nested lists)
# First row, first column (remember Python is zero index!)
y[0][0]

'Another'

In [11]:
# First row, second column:
y[0][1]

'string'

In [12]:
# Second row, first column:
y[1][0]

'because'

In [13]:
# Second row, second column:
y[1][1]

'why not?'

### In pandas:

In [14]:
# Run this cell to create the DataFrame for semi-annual sales below:

sales = pd.DataFrame(
    {"Month" : ["Jan", "Feb", "Mar", "Apr", "Jun", "Jul"],
     "Shirts" : [270.23, 312.86, 361.22, 329.20, 300.45, 336.14],
     "Shoes" : [530.06, 512.96, 561.30, 525.32, 598.50, 494.41],
     "Hats" : [103.33, 114.64, 160.42, 121.21, 109.51, 106.33],
     "Scarfs": [455.32, 401.65, 381.02, 229.99, 100.75, 30.66]},
    index = [0,1,2,3,4,5]
)

sales

  Month  Shirts   Shoes    Hats  Scarfs
0   Jan  270.23  530.06  103.33  455.32
1   Feb  312.86  512.96  114.64  401.65
2   Mar  361.22  561.30  160.42  381.02
3   Apr  329.20  525.32  121.21  229.99
4   Jun  300.45  598.50  109.51  100.75
5   Jul  336.14  494.41  106.33   30.66

***How might we retrieve the value for scarf sales in January?***

In [15]:
# Use the brackets [][]
# Notice that we pass the column first here (as opposed to string or list
# indexing where we pass the row first).
# Also, notice that we can only use values in the index in the second bracket!

sales['Scarfs'][0]

455.32

***What if we wanted the shoe sales data for all six months?***

In [17]:
sales['Shoes']

# By not specifying a row index like we did above, 
# pandas returns all the rows by default. In this case,
# there are only six rows (one per month).

0    530.06
1    512.96
2    561.30
3    525.32
4    598.50
5    494.41
Name: Shoes, dtype: float64

In [18]:
# Besides bracket notation, you can also call a specific column
# like this:

sales.Shoes

0    530.06
1    512.96
2    561.30
3    525.32
4    598.50
5    494.41
Name: Shoes, dtype: float64

In [19]:
# Slicing also works here. If I want the first 3 rows of the column 'Shoes'...

sales.Shoes[0:3]

# Again, notice the small (but important) difference. When slicing a list, the 
# second number is exclusive. In pandas, it's inclusive. 

# equivalent to:
# sales['Shoes'][0:3]

0    530.06
1    512.96
2    561.30
Name: Shoes, dtype: float64

### Accessors
As the name suggests, accessors are pandas methods to help you access specific values inside your DataFrame. There are two main "accessor" methods:

* .loc()  -  based on row/column position
* .iloc()  -  based on indexes label

***Both*** follow the same convention:  

```
df.loc['row label']['column label']
df.iloc['row index']['column index']
```

In [20]:
sales

  Month  Shirts   Shoes    Hats  Scarfs
0   Jan  270.23  530.06  103.33  455.32
1   Feb  312.86  512.96  114.64  401.65
2   Mar  361.22  561.30  160.42  381.02
3   Apr  329.20  525.32  121.21  229.99
4   Jun  300.45  598.50  109.51  100.75
5   Jul  336.14  494.41  106.33   30.66

In [21]:
# Let's use .iloc to find the sales data for shirts in April:

sales.iloc[3][1]

# Notice that the accesor methods (like lists!) expect rows, then columns.
# 0-indexing still applies!

329.2

## Subsetting
Let's say we need to create a DataFrame to hold just the sales data for the first quarter of the year rather than the first half of the year.

In [22]:
sales_Q1 = sales.iloc[0:3,:]

# Ok, working from right to left, here's what's going on:

# 1) We're selecting all the columns with an open slice [:]
# 2) We're selecting the first 3 rows with 0:3 (it's inclusive)
# 3) We're using the index-based .iloc method to do this
# 4) We're subsetting data from the sales DataFrame
# 5) And assigning it to a new variable, sales_Q1

In [23]:
sales_Q1

  Month  Shirts   Shoes    Hats  Scarfs
0   Jan  270.23  530.06  103.33  455.32
1   Feb  312.86  512.96  114.64  401.65
2   Mar  361.22  561.30  160.42  381.02

Notice that the following would also result in the same DataFrame:

```
sales_Q1 = sales.loc[[0,1,2],['Month', 'Shirts', 'Shoes', 'Hats', 'Scarfs']]

sales_Q1 = sales.iloc[[0,1,2],[0,1,2,3,4]]
```

.loc is being passed the column labels, iloc is being passed the column index positions.

In [24]:
sales.loc[0:3,:]

  Month  Shirts   Shoes    Hats  Scarfs
0   Jan  270.23  530.06  103.33  455.32
1   Feb  312.86  512.96  114.64  401.65
2   Mar  361.22  561.30  160.42  381.02
3   Apr  329.20  525.32  121.21  229.99

In [25]:
sales.iloc[0:3,:]

  Month  Shirts   Shoes    Hats  Scarfs
0   Jan  270.23  530.06  103.33  455.32
1   Feb  312.86  512.96  114.64  401.65
2   Mar  361.22  561.30  160.42  381.02

## Filtering
By leveraging Python operators, we can filter our DataFrames with conditions of our own choosing. For example, let's see all the months where scarfs sold *at least* $400:

In [26]:
sales

  Month  Shirts   Shoes    Hats  Scarfs
0   Jan  270.23  530.06  103.33  455.32
1   Feb  312.86  512.96  114.64  401.65
2   Mar  361.22  561.30  160.42  381.02
3   Apr  329.20  525.32  121.21  229.99
4   Jun  300.45  598.50  109.51  100.75
5   Jul  336.14  494.41  106.33   30.66

In [22]:
sales.Scarfs >= 400

0     True
1     True
2    False
3    False
4    False
5    False
Name: Scarfs, dtype: bool

In [23]:
sales['Hats'] >= 120

0    False
1    False
2     True
3     True
4    False
5    False
Name: Hats, dtype: bool

In [24]:
condition = sales['Hats'] >= 120

sales[condition]

  Month  Shirts   Shoes    Hats  Scarfs
2   Mar  361.22  561.30  160.42  381.02
3   Apr  329.20  525.32  121.21  229.99

In [27]:
filtered = sales[sales['Hats'] >= 120]
filtered

  Month  Shirts   Shoes    Hats  Scarfs
2   Mar  361.22  561.30  160.42  381.02
3   Apr  329.20  525.32  121.21  229.99

In [26]:
filtered.iloc[1][1]

329.2

In [27]:
filtered.loc[3][1]

329.2

In [28]:
filtered.loc[3][1]

329.2

In [29]:
df = filtered.reset_index()

df

   index Month  Shirts   Shoes    Hats  Scarfs
0      2   Mar  361.22  561.30  160.42  381.02
1      3   Apr  329.20  525.32  121.21  229.99

In [30]:
df.loc[1][3]

525.32

In [31]:
df.iloc[1][3]

525.32

## Changing the Index

So we can see that this condition was true for the first two months. You can tell by referencing the months to the index (Jan = 0, Feb = 1, etc).  
But that's annoying. Why don't we make the ['Month'] column the index instead?

In [32]:
sales.set_index('Month', inplace=True)

#Remember that inplace=True is necessary for the change to persist.

In [33]:
sales

       Shirts   Shoes    Hats  Scarfs
Month
Jan    270.23  530.06  103.33  455.32
Feb    312.86  512.96  114.64  401.65
Mar    361.22  561.30  160.42  381.02
Apr    329.20  525.32  121.21  229.99
Jun    300.45  598.50  109.51  100.75
Jul    336.14  494.41  106.33   30.66

In [34]:
sales.loc['Feb'][1]

512.96

In [35]:
sales.iloc[1][1]

512.96

In [36]:
sales.iloc["Feb"][1]

TypeError: Cannot index by location index with a non-integer key

That's better.

### These are a few of the many ways to extract different values from DataFrames.